3A/CS349/Effects.tex
% Created 2024-04-19 Fri 02:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Effects}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Effects},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Controlled/Uncontrolled Components}
\label{sec:orga742dec}
Component data flow is how HTML form element values are associated with application state.

\textbf{Uncontrolled components} have HTML form elements manage their own data values.
\textbf{Controlled components} have application state manage HTML form element data values.

\textbf{Controlled conditional components} are a more advanced method of handling text input with
validation.
Input text changes state only when valid, and when not focused for editing, input text
matches state.

Key ideas of controlled conditional components:
\begin{itemize}
\item local state to display input value
\item \texttt{useEffect} to update local state when app state changes
\item only updates application state when valid input
\item leave text input value with valid value when executing
\item only render error message when invalid
\end{itemize}

Side effects are changes outside the VDOM render where code is run as a result of VDOM
change and reaches out of the VDOM tree to mutate state or invoke imperative code (ex.
DOM APIs).

Preact side effect methods are \texttt{useRef}, \texttt{useEffect}, and \texttt{useLayoutEffect} hooks.
\section{Canvas Components}
\label{sec:org4957e30}
ResizeObserver is an HTML DOM feature, like window-resize for elements.
\section{CSS Style for Components}
\label{sec:org8f6e6f7}
Approaches:
\begin{itemize}
\item separate CSS file for each components
\item inline CSS attributes in component render
\item import component specific CSS module file
\item utility classes (ex. Tailwind)
\end{itemize}

For inline CSS, the style attribute accepts a JS object for CSS properties, with
camelCase instead of kebab-case.
Convention is to crate const object and assign in render.
No flexibility in rules, selectors, etc.

With CSS modules, class names are locally scoped to components, so unique class names
are generated. Assign classes in render.

Tailwind is a utility-first CSS framework, with class names as style properties (called
utility classes). No media queries, but size prefix instead.
Same strategy for hover, focus, etc.
Bundler removes all unused CSS for production.
Approach works best with declarative UI programming.

Tailwind philosophy is to have no predesigned components, but does CSS reset (preflight) and
developer must add basic styling for everything.

Tailwind is mobile-first responsive, so provides a screen prefix to use instead of media queries.
Screen prefix identifies when to use utility class, with mobile as default.

Tailwind plugins allow registering new styles for Tailwind to inject inot user stylesheet.
\end{document}
